1сУчетОборудования/Documents/СписаниеОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СписаниеОборудования</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиОборудования</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричинаСписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйОбъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнвентарныеОбъекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1сУчетОборудования/AccumulationRegisters/ОстаткиОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиОборудования</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураОборудования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1сУчетОборудования/Enums/СтатусОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВЭксплуатации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРемонте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1сУчетОборудования/Documents/СписаниеОборудования/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	 Попытка

    Движения.ОстаткиОборудования.Записывать = Истина;

    Для Каждого Стр Из Оборудование Цикл

        Если Стр.ИнвентарныйОбъект = Неопределено Тогда
            ВызватьИсключение "Не выбран инвентарный объект!";
        КонецЕсли;

        // --- Остатки ---
        Запрос = Новый Запрос;
        Запрос.Текст =
        "ВЫБРАТЬ
        |   Остатки.КоличествоОстаток КАК Количество,
        |   Остатки.Подразделение,
        |   Остатки.Сотрудник
        |ИЗ
        |   РегистрНакопления.ОстаткиОборудования.Остатки(
        |       ,
        |       ИнвентарныйОбъект = &Объект) КАК Остатки";

        Запрос.УстановитьПараметр("Объект", Стр.ИнвентарныйОбъект);

        Выборка = Запрос.Выполнить().Выбрать();

        Если НЕ Выборка.Следующий() Тогда
            ВызватьИсключение "Объект отсутствует на остатках!";
        КонецЕсли;

        Если Выборка.Количество <= 0 Тогда
            ВызватьИсключение "Объект уже списан!";
        КонецЕсли;

        // --- движение ---
        Движение = Движения.ОстаткиОборудования.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период = Дата;
        Движение.ИнвентарныйОбъект = Стр.ИнвентарныйОбъект;
        Движение.Номенклатура = Стр.ИнвентарныйОбъект.Номенклатура;
        Движение.Подразделение = Выборка.Подразделение;
        Движение.Сотрудник = Выборка.Сотрудник;
        Движение.Количество = 1;

        // --- статус ---
        ОбъектОборудования = Стр.ИнвентарныйОбъект.ПолучитьОбъект();
        ОбъектОборудования.Статус =
            Перечисления.СтатусОборудования.Списано;
        ОбъектОборудования.Записать();

    КонецЦикла;

Исключение
    Отказ = Истина;
    Сообщить("Ошибка списания: " + ОписаниеОшибки());
КонецПопытки;




КонецПроцедуры
